<?php
return [
//    Страница настроек "Предпочтения"
    'preferred_language' => 'Предпочитаемый язык',
    'timezone' => 'Часовой пояс',
    'save_changes' => 'Сохранить изменения',
    'english' => 'Английский',
    'russian' => 'Русский',
    'german' => 'Немецкий',
    'ukrainian' => 'Украинский',

    //    Названия настроек в ленте слева
    'appearance_settings' => 'Настройки внешнего вида',
    'personal_data'       => 'Личные данные',
    'privacy_settings'    => 'Настройки приватности',
    'security'            => 'Безопасность',
    'preferences'         => 'Настройки предпочтений',
];