<?php
return [
//    Страница настроек "Предпочтения"
    'preferred_language' => 'Предпочитаемый язык',
    'timezone' => 'Часовой пояс',
    'save_changes' => 'Сохранить изменения',
    'english' => 'Английский',
    'russian' => 'Русский',
    'german' => 'Немецкий',
    'ukrainian' => 'Украинский',

    //    Названия настроек в ленте слева
    'appearance_settings' => 'Настройки внешнего вида',
    'personal_data'       => 'Личные данные',
    'privacy_settings'    => 'Настройки приватности',
    'security'            => 'Безопасность',
    'preferences'         => 'Настройки предпочтений',
    'delete_account'      => 'Удалить аккаунт',
    'delete_account_description' => 'Удаление аккаунта — это необратимое действие. Пожалуйста, подтвердите, что вы хотите удалить свой аккаунт.',
    'enter_password' => 'Введите ваш пароль',
    'delete_account_button' => 'Удалить аккаунт',
    'delete_account_warning' => 'После удаления аккаунта все ваши данные будут безвозвратно утеряны.',
    //    Страница настроек "Безопасность"
    'current_password' => 'Текущий пароль',
    'new_password' => 'Новый пароль',
    'confirm_password' => 'Подтвердите новый пароль',
    'placeholder_current_password' => 'Введите текущий пароль',
    'placeholder_new_password' => 'Введите новый пароль',
    'placeholder_confirm_password' => 'Подтвердите новый пароль',

    // Управление активными сессиями
    'your_session' => 'Ваша сессия (Вы онлайн)',
    'online' => '🟢 Онлайн',
    'device' => 'Устройство',
    'ip_address' => 'IP-адрес',
    'location' => 'Местоположение',
    'unknown' => 'Неизвестно',

    'other_active_sessions' => 'Другие активные сессии',
    'close_session' => 'Закрыть',
    'no_other_sessions' => 'Нет других активных сессий.',

    //    Страница настроек "Приватности"
    'profile_visibility' => 'Видимость профиля',
    'public' => 'Публичный',
    'private' => 'Приватный',
    'show_last_seen' => 'Показывать последнее посещение другим',

    //    Страница настроек "Личных данных"
    'login' => 'Логин',
    'current_login' => 'Текущий логин: ',
    'enter_new_login' => 'Введите новый логин',
    'email' => 'Эл. почта',
    'current_email' => 'Текущая эл. почта: ',
    'enter_new_email' => 'Введите новый адрес эл. почты',
    'password' => 'Пароль',
    'password_placeholder' => 'Введите текущий пароль, чтобы изменить настройки',

    //    Страница настроек "Внешнего вида"
    'choose_theme' => 'Выберите тему:',
    'light' => 'Светлая',
    'dark' => 'Тёмная',
    'font_size' => 'Размер шрифта:',
    'font_style' => 'Стиль шрифта:',
    'sans_serif' => 'Без засечек',
    'serif' => 'С засечками',
    'monospace' => 'Моноширинный',
    'georgia' => 'Грузия',
    'verdana' => 'Вердана',

    //    Настройки навигации справа
    'my_profile' => 'Мой профиль',
    'my_articles' => 'Мои статьи',
    'my_subscriptions' => 'Мои подписки',
    'write_article' => 'Написать статью',
    'favourites' => 'Избранное',
    'notifications' => 'Уведомления',
    'settings' => 'Настройки',
    'logout' => 'Выход',

    //    Профиль
    'followers' => 'Подписчики',
    'followings' => 'Подписки',
    'registered' => 'Зарегистрирован',
    'specialization' => 'Специализация',
    'company' => 'Компания',
    'experience' => 'Опыт',
    'years' => 'лет',
    'articles' => 'Статьи',
    'profile' => 'Профиль',
    'my_publications' => 'Мои публикации',
    'my_courses' => 'Мои курсы',
    'cancel_request' => 'Отменить запрос',
    'unfollow' => 'Отписаться',
    'follow' => 'Подписаться',
    'cancel' => 'Отменить',
    'add_description' => 'Чтобы добавить описание, нажмите на кнопку редактирования выше.',
    'add_article' => 'Добавить статью',
    'user_publication' => 'Здесь ваши публикации. Загрузите свою работу здесь!',
    'user_courses' => 'Это ваши курсы. Начните учиться сейчас!',

    //    Фильтры
    'title' => 'Название:',
    'filter_title_placeholder' => 'Название статьи',
    'filter_author' => 'Автор:',
    'filter_author_placeholder' => 'Имя автора',
    'filter_from_date' => 'С (дата сохранения (примерно)):',
    'filter_to_date' => 'По (дата сохранения (примерно)):',
    'filter_apply' => 'Применить фильтр',

    //    Категории
    'category'          => 'Категория:',
    'select_category'   => 'Выберите категорию',
    'programming'       => 'Программирование',
    'ai'                => 'Искусственный интеллект',
    'web_development'   => 'Веб-разработка',
    'data_science'      => 'Наука о данных',
    'cyber_security'    => 'Кибербезопасность',
    'cloud_computing'   => 'Облачные вычисления',
    'machine_learning'  => 'Машинное обучение',
    'it_news'           => 'IT новости',

    //    Поиск
    'feed' => 'Лента',
    'no_feed' => 'Нет публикаций от ваших подписок',
    'popular_articles' => 'Популярные статьи',
    'popular_courses'  => 'Популярные курсы',
    'popular_writers'  => 'Популярные IT-писатели',
    'it_events'        => 'IT-события',
    'placeholder_search' => 'Введите ваш запрос...',
    'date' => 'Дата',
    'show_more' => 'Показать больше',
    'search_by_tag' => 'Поиск по тегу',
    'search' => 'Поиск',
//    Репосты
    'view_statistics'    => 'Просмотр статистики статьи',
    'delete'    => 'Удалить',
    'change_description' => 'Изменить описание',

    //    Статистика
    'statistics_for' => 'Статистика для "%s"',
    'likes'          => 'Лайки',
    'view_likes'     => 'Посмотреть лайки',
    'dislikes'       => 'Дизлайки',
    'view_dislikes'  => 'Посмотреть дизлайки',
    'views'          => 'Просмотры',
    'author'         => 'Автор',
    'created_at'     => 'Создано',

    //    Уведомления
    'your_notifications' => 'Ваши уведомления',

    //    Форма статей
    'content'                          => 'Содержимое:',
    'write_article_content_placeholder'=> 'Напишите вашу статью здесь...',
    'create_table'                     => 'Создать таблицу',
    'rows'                             => 'Строки:',
    'columns'                          => 'Столбцы:',
    'insert_table'                     => 'Создать таблицу',
    'difficulty'             => 'Сложность:',
    'select_difficulty'      => 'Выберите сложность',
    'beginner'               => 'Начальный',
    'intermediate'           => 'Средний',
    'advanced'               => 'Продвинутый',
    'estimated_read_time'    => 'Предполагаемое время чтения (в минутах):',
    'tags'                   => 'Теги, например, IT-языки (через запятую):',
    'tags_placeholder'       => 'Тег1, Тег2, Тег3',
    'tag_warning'            => 'Не более 10 тегов!',
    'youtube_link'           => 'Ссылка на YouTube:',
    'youtube_link_placeholder'=> 'https://www.youtube.com/embed/xyz',
    'cover_image'            => 'Загрузить обложку:',
    'cover_image_preview'    => 'Превью обложки',
    'publish'                => 'Опубликовать:',
    'create_article' => 'Создать статью',

//    Редактирование
    'edit_description'           => 'Редактировать описание',
    'description'                => 'Описание',
    'enter_description_placeholder'=> 'Введите ваше описание здесь...',
    'save'                       => 'Сохранить',
    'back'                       => 'Назад',

//    Поиск
    'view_profile'    => 'Смотреть профиль',

    //    Курсы
    'create_course' => 'Создать новый курс',
    'course_title' => 'Название курса',
    'course_description' => 'Описание курса',
    'create_course_button' => 'Создать курс',
    'select_articles_button' => 'Выбрать статью',
    'search_articles' => 'Искать статью',
    'articles_selected' => 'Выбранные статьи',
    'no_courses' => 'У вас пока нет курсов',
    'open_course' => 'Открыть курс',
    'edit'           => 'Редактировать',
    'courses_articles'           => 'Статьи курса',
    'no_articles'           => 'В этом курсе пока нет статей',
    'videos'           => 'Видео к курсу',
    'course_progress'           => 'Прогресс курса',
    'course_passed'           => 'Пройдено',
    'course_materials'   => 'Материалы курса',
    'upload'   => 'Загрузить',
    'course_visibility' => 'Видимость курса',


];