<?php
return [
    //    Страница настроек "Предпочтения"
    'preferred_language' => 'Бажана мова',
    'timezone' => 'Часовий пояс',
    'save_changes' => 'Зберегти зміни',
    'english' => 'Англійська',
    'russian' => 'Російська',
    'german' => 'Німецька',
    'ukrainian' => 'Українська',


    //    Названия настроек в ленте слева
    'appearance_settings'   => 'Налаштування зовнішнього вигляду',
    'personal_data'         => 'Особисті дані',
    'privacy_settings'      => 'Налаштування приватності',
    'security'              => 'Безпека',
    'preferences'           => 'Налаштування переваг',
    'delete_account'        => 'Видалити акаунт',
    'delete_account_description' => 'Видалення акаунта є незворотним дією. Будь ласка, підтвердіть, що ви хочете видалити свій акаунт.',
    'enter_password' => 'Введіть ваш пароль',
    'delete_account_button' => 'Видалити акаунт',
    'delete_account_warning' => 'Після видалення акаунта всі ваші дані будуть безповоротно втрачені.',
    //    Страница настроек "Безопасность"
    'current_password' => 'Поточний пароль',
    'new_password' => 'Новий пароль',
    'confirm_password' => 'Підтвердіть новий пароль',
    'placeholder_current_password' => 'Введіть поточний пароль',
    'placeholder_new_password' => 'Введіть новий пароль',
    'placeholder_confirm_password' => 'Підтвердьте новий пароль',
    'hide_email' => 'Сховати email
Увага: У такому разі користувачі у ваших приватних курсах не зможуть до вас звернутися.',
    'contact_hidden' => 'Контакт приховано',

    // Управление активными сессиями
    'your_session' => 'Ваша сесія (Ви онлайн)',
    'online' => '🟢 Онлайн',
    'device' => 'Пристрій',
    'ip_address' => 'IP-адреса',
    'location' => 'Місцезнаходження',
    'unknown' => 'Невідомо',

    'other_active_sessions' => 'Інші активні сесії',
    'close_session' => 'Закрити',
    'no_other_sessions' => 'Немає інших активних сесій.',

    //    Страница настроек "Приватности"
    'profile_visibility' => 'Видимість профілю',
    'public' => 'Публічний',
    'private' => 'Приватний',
    'show_last_seen' => 'Показувати останній вхід іншим',

    //    Страница настроек "Личных данных"
    'login' => 'Логін',
    'current_login' => 'Поточний логін: ',
    'enter_new_login' => 'Введіть новий логін',
    'email' => 'Електронна пошта',
    'current_email' => 'Поточна електронна пошта: ',
    'enter_new_email' => 'Введіть нову електронну пошту',
    'password' => 'Пароль',
    'password_placeholder' => 'Введіть поточний пароль, щоб змінити налаштування',

    //    Страница настроек "Внешнего вида"
    'choose_theme' => 'Виберіть тему:',
    'light' => 'Світла',
    'dark' => 'Темна',
    'font_size' => 'Розмір шрифту:',
    'font_style' => 'Стиль шрифту:',
    'sans_serif' => 'Без засічок',
    'serif' => 'Із засічками',
    'monospace' => 'Моноширинний',
    'georgia' => 'Грузія',
    'verdana' => 'Вердана',

    //    Настройки навигации справа
    'my_profile' => 'Мій профіль',
    'my_articles' => 'Мої статті',
    'my_subscriptions' => 'Мої підписки',
    'write_article' => 'Написати статтю',
    'favourites' => 'Обране',
    'notifications' => 'Сповіщення',
    'settings' => 'Налаштування',
    'logout' => 'Вихід',
    'select_country' => 'Країна',
    'select_city' => 'Місто',


    //    Профиль
    'followers' => 'Підписники',
    'followings' => 'Підписки',
    'registered' => 'Зареєстрований',
    'specialization' => 'Спеціалізація',
    'company' => 'Компанія',
    'experience' => 'Досвід',
    'years' => 'років',
    'articles' => 'Статті',
    'profile' => 'Профіль',
    'my_publications' => 'Мої публікації',
    'my_courses' => 'Мої курси',
    'cancel_request' => 'Скасувати запит',
    'unfollow' => 'Відписатися',
    'follow' => 'Пыдписатися',
    'cancel' => 'Відмінити',
    'add_description' => 'Щоб додати опис, натисніть на кнопку редагування вище.',
    'user_publication' => 'Тут ваші публікації. Завантажте свою роботу тут!',
    'user_courses' => 'Це ваші курси. Почніть навчатися зараз!',
//    Редактирование
    'edit_description'           => 'Редагувати опис',
    'description'                => 'Опис',
    'enter_description_placeholder'=> 'Введіть ваш опис тут...',
    'save'                       => 'Зберегти',
    'back'                       => 'Назад',

    //    Фильтры
    'title' => 'Заголовок:',
    'filter_title_placeholder' => 'Назва статті',
    'filter_author' => 'Автор:',
    'filter_author_placeholder' => 'Ім’я автора',
    'filter_from_date' => 'Від (дата збереження (приблизно)):',
    'filter_to_date' => 'До (дата збереження (приблизно)):',
    'filter_apply' => 'Застосувати фільтр',

    //    Категории
    'category'          => 'Категорія:',
    'select_category'   => 'Оберіть категорію',
    'programming'       => 'Програмування',
    'ai'                => 'Штучний інтелект',
    'web_development'   => 'Веб-розробка',
    'data_science'      => 'Наука про дані',
    'cyber_security'    => 'Кібербезпека',
    'cloud_computing'   => 'Хмарні обчислення',
    'machine_learning'  => 'Машинне навчання',
    'it_news'           => 'IT новини',

    //    Поиск
    'feed' => 'Стрічка',
    'no_feed' => 'Немає публікацій від ваших підписок',
    'popular_articles' => 'Популярні статті',
    'popular_courses'  => 'Популярні курси',
    'popular_writers'  => 'Популярні IT-письменники',
    'it_events'        => 'IT-події',
    'placeholder_search' => 'Введіть ваш запит...',
    'date' => 'Дата',
    'show_more' => 'Більше',
    'search_by_tag' => 'Пошук за тегом',
    'search' => 'Пошук',
    //    Статистика
    'statistics_for' => 'Статистика для "%s"',
    'likes'          => 'Лайки',
    'view_likes'     => 'Переглянути лайки',
    'dislikes'       => 'Дизлайки',
    'view_dislikes'  => 'Переглянути дизлайки',
    'views'          => 'Перегляди',
    'author'         => 'Автор',
    'created_at'     => 'Створено',

    //    Уведомления
    'your_notifications' => 'Ваші сповіщення',

    //    Форма статей
    'content'                          => 'Зміст:',
    'write_article_content_placeholder'=> 'Напишіть вашу статтю тут...',
    'create_table'                     => 'Створити таблицю',
    'rows'                             => 'Рядки:',
    'columns'                          => 'Стовпці:',
    'insert_table'                     => 'Створити таблицю',
    'difficulty'             => 'Складність:',
    'select_difficulty'      => 'Оберіть складність',
    'beginner'               => 'Початковий',
    'intermediate'           => 'Середній',
    'advanced'               => 'Просунутий',
    'estimated_read_time'    => 'Орієнтовний час читання (в хвилинах):',
    'tags'                   => 'Теги, наприклад, IT-мови (через кому):',
    'tags_placeholder'       => 'Тег1, Тег2, Тег3',
    'tag_warning'            => 'Не більше 10 тегів!',
    'youtube_link'           => 'Посилання на YouTube:',
    'youtube_link_placeholder'=> 'https://www.youtube.com/embed/xyz',
    'cover_image'            => 'Завантажити обкладинку:',
    'cover_image_preview'    => 'Попередній перегляд обкладинки',
    'publish'                => 'Опублікувати:',
    'create_article' => 'Створити статтю',
    'add_article' => 'Додати статтю',

//    Поиск
    'view_profile'    => 'Переглянути профіль',
//    Репосты
    'view_statistics'    => 'Переглянути статистику статті',
    'delete'    => 'Видалити',
    'change_description' => 'Змінити опис',

    //    Курсы
    'create_course' => 'Створити новий курс',
    'course_title' => 'Назва курсу',
    'course_description' => 'Опис курсу',
    'create_course_button' => 'Створити курс',
    'select_articles_button' => 'Обрати статті',
    'search_articles' => 'Шукати статті',
    'articles_selected' => 'Обрані статті',
    'no_courses' => 'У вас поки що немає курсів',
    'open_course' => 'Відкрити курс',
    'edit'           => 'Редактувати',
    'courses_articles'           => 'Статті курсу',
    'no_articles'           => 'У цьому курсі поки що немає статей',
    'videos'           => 'Відео до курсів',
    'course_progress'           => 'Прогрес курсу',
    'course_passed'           => 'Пройдено',
    'course_materials'   => 'Матеріали до курсу',
    'upload'   => 'Завантажити',
    'course_visibility' => 'Видимість курсу',
    'visibility_public' => 'Відкритий доступ для всіх',
    'visibility_subscribers' => 'Тільки підписники',
    'visibility_custom' => 'Обрати користувача',
    'selected_users' => 'Обрані користувачі',
    'view_course_subscribers' => 'Подивитись підписників курсу',
    'request_access' => 'Запросити доступ',
    'private_course' => 'Приватний курс',
    'materials_count' => 'Кількість матеріалів',
    'course_information' => 'Інформація про курс',
    'article_amount' => 'Кількість статей',
    'course_time' => 'Приблизний час для проходження',
    'difficulty_level' => 'Рівень складності',
    'hours' => 'годин',
    'course_difficulty' => 'Складність курсу',
    'follow_owner' => 'Підписатися на власника',
    'recommendatios' => 'Рекомендовані курси',
    'favorite_courses' => 'Збережені курси',
    'students_enrolled' => 'Кількість учасників',

    //    Футер
    'about' => 'Про сайт',
    //    О сайте
    'website_description' => '<p>Мій сайт надає унікальну платформу для обміну знаннями, навчання та особистісного розвитку. Ми прагнемо створити спільноту, де кожен може не тільки ділитися своїми знаннями, але й активно розвиватися, отримуючи доступ до різноманітних статей, освітніх курсів і корисних ресурсів. На нашому сайті ви знайдете актуальні матеріали з різних тем, зокрема IT, технології, самоосвіта та багато іншого.</p>
                <p>Ми даємо кожному користувачу можливість не лише навчатися, а й створювати власні курси та статті, роблячи внесок у розвиток нашої платформи. Тут можна ділитися досвідом, створювати обговорення та отримувати цінні поради від інших учасників. Ми віримо в силу спільноти і прагнемо зробити наш простір комфортним і корисним для кожного, хто готовий навчатися і рости.</p>
                <p>Особливу увагу ми приділяємо актуальним IT новинам і трендам. Ми обговорюємо останні події в світі технологій, що дозволяє нам тримати руку на пульсі та бути в курсі найбільш значущих змін в індустрії. Приєднуйтесь до нас і станьте частиною активної та надихаючої спільноти!</p>',

    'website_goals'=> '<h2>Наші цілі:</h2> 
                <ul> 
                    <li><strong>Надання якісного контенту:</strong> Ми прагнемо запропонувати нашим користувачам лише перевірені та актуальні матеріали. Кожен курс, стаття та ресурс проходять ретельну перевірку, щоб ви могли отримувати знання, що відповідають найвищим стандартам.</li> 
                    <li><strong>Створення спільноти людей, зацікавлених у навчанні:</strong> Ми переконані, що навчання – це не лише отримання знань, а й обмін досвідом. Ми створюємо простір, де кожен може зробити свій внесок, поділитися досвідом і навчатися у інших.</li> 
                    <li><strong>Забезпечення зручного доступу до матеріалів:</strong> Наша мета – зробити навчання доступним і зручним. Усі ресурси на сайті легко знайти та використовувати, будь то відеоуроки, статті чи курси. Ми робимо все, щоб навчання було комфортним і доступним для всіх.</li> 
                </ul>',
    'website_contacts'=> '<h2>Контакти:</h2> 
                <p>Якщо у вас виникли питання, пропозиції або побажання, ми завжди раді вам допомогти. Зв’яжіться з нами будь-яким зручним для вас способом:</p> 
                <ul> 
                    <li>За електронною поштою: <a href="mailto:vedmedykportal@gmail.com">vedmedykportal@gmail.com</a></li> 
                </ul>',
    'website_coperation'=> 'Кооперація',
    //    Контактна форма
    'connect_with_us' => 'Зв’яжіться з нами',
    'user_name' => 'Ваше ім’я',
    'user_email' => 'Ваш email',
    'message' => 'Повідомлення',
    'send' => 'Відправити',

    //    Куки
    'cookie' => 'Цей сайт використовує cookies для покращення роботи',
    'more_details' => 'Докладніше',
    'understood' => 'Зрозуміло',
    'privacy_policy' => 'Політика конфіденційності',
    'privacy_content' => [
        '1' => 'Ми цінуємо вашу конфіденційність. Цей вебсайт використовує cookies для покращення досвіду користувачів і надання персоналізованого контенту.',
        '2' => 'Cookies - це невеликі файли даних, що зберігаються на вашому пристрої. Вони допомагають нам зрозуміти, як користувачі взаємодіють із нашим вебсайтом, покращити продуктивність і пропонувати функції, що відповідають вашим перевагам.',
        '3' => 'Продовжуючи використовувати цей сайт, ви погоджуєтеся з використанням cookies, як описано в цій політиці. Ви можете керувати або вимкнути cookies через налаштування вашого браузера у будь-який час.',
        '4' => 'Для додаткової інформації про використання ваших даних, будь ласка, зв’яжіться з нами або зверніться до наших повних умов обслуговування.'
    ]
];