<?php
return [
    //    Страница настроек "Предпочтения"
    'preferred_language' => 'Бажана мова',
    'timezone' => 'Часовий пояс',
    'save_changes' => 'Зберегти зміни',
    'english' => 'Англійська',
    'russian' => 'Російська',
    'german' => 'Німецька',
    'ukrainian' => 'Українська',


    //    Названия настроек в ленте слева
    'appearance_settings'   => 'Налаштування зовнішнього вигляду',
    'personal_data'         => 'Особисті дані',
    'privacy_settings'      => 'Налаштування приватності',
    'security'              => 'Безпека',
    'preferences'           => 'Налаштування переваг',
    'delete_account'        => 'Видалити акаунт',
    'delete_account_description' => 'Видалення акаунта є незворотним дією. Будь ласка, підтвердіть, що ви хочете видалити свій акаунт.',
    'enter_password' => 'Введіть ваш пароль',
    'delete_account_button' => 'Видалити акаунт',
    'delete_account_warning' => 'Після видалення акаунта всі ваші дані будуть безповоротно втрачені.',
    //    Страница настроек "Безопасность"
    'current_password' => 'Поточний пароль',
    'new_password' => 'Новий пароль',
    'confirm_password' => 'Підтвердіть новий пароль',
    'placeholder_current_password' => 'Введіть поточний пароль',
    'placeholder_new_password' => 'Введіть новий пароль',
    'placeholder_confirm_password' => 'Підтвердьте новий пароль',

    // Управление активными сессиями
    'your_session' => 'Ваша сесія (Ви онлайн)',
    'online' => '🟢 Онлайн',
    'device' => 'Пристрій',
    'ip_address' => 'IP-адреса',
    'location' => 'Місцезнаходження',
    'unknown' => 'Невідомо',

    'other_active_sessions' => 'Інші активні сесії',
    'close_session' => 'Закрити',
    'no_other_sessions' => 'Немає інших активних сесій.',

    //    Страница настроек "Приватности"
    'profile_visibility' => 'Видимість профілю',
    'public' => 'Публічний',
    'private' => 'Приватний',
    'show_last_seen' => 'Показувати останній вхід іншим',

    //    Страница настроек "Личных данных"
    'login' => 'Логін',
    'current_login' => 'Поточний логін: ',
    'enter_new_login' => 'Введіть новий логін',
    'email' => 'Електронна пошта',
    'current_email' => 'Поточна електронна пошта: ',
    'enter_new_email' => 'Введіть нову електронну пошту',
    'password' => 'Пароль',
    'password_placeholder' => 'Введіть поточний пароль, щоб змінити налаштування',

    //    Страница настроек "Внешнего вида"
    'choose_theme' => 'Виберіть тему:',
    'light' => 'Світла',
    'dark' => 'Темна',
    'font_size' => 'Розмір шрифту:',
    'font_style' => 'Стиль шрифту:',
    'sans_serif' => 'Без засічок',
    'serif' => 'Із засічками',
    'monospace' => 'Моноширинний',
    'georgia' => 'Грузія',
    'verdana' => 'Вердана',

    //    Настройки навигации справа
    'my_profile' => 'Мій профіль',
    'my_articles' => 'Мої статті',
    'my_subscriptions' => 'Мої підписки',
    'write_article' => 'Написати статтю',
    'favourites' => 'Обране',
    'notifications' => 'Сповіщення',
    'settings' => 'Налаштування',
    'logout' => 'Вихід',


    //    Профиль
    'followers' => 'Підписники',
    'followings' => 'Підписки',
    'registered' => 'Зареєстрований',
    'specialization' => 'Спеціалізація',
    'company' => 'Компанія',
    'experience' => 'Досвід',
    'years' => 'років',
    'articles' => 'Статті',
    'profile' => 'Профіль',
    'my_publications' => 'Мої публікації',
    'my_courses' => 'Мої курси',
    'cancel_request' => 'Скасувати запит',
    'unfollow' => 'Відписатися',
    'follow' => 'Пыдписатися',
    'cancel' => 'Відмінити',
    'add_description' => 'Щоб додати опис, натисніть на кнопку редагування вище.',
    'user_publication' => 'Тут ваші публікації. Завантажте свою роботу тут!',
    'user_courses' => 'Це ваші курси. Почніть навчатися зараз!',
//    Редактирование
    'edit_description'           => 'Редагувати опис',
    'description'                => 'Опис',
    'enter_description_placeholder'=> 'Введіть ваш опис тут...',
    'save'                       => 'Зберегти',
    'back'                       => 'Назад',

    //    Фильтры
    'title' => 'Заголовок:',
    'filter_title_placeholder' => 'Назва статті',
    'filter_author' => 'Автор:',
    'filter_author_placeholder' => 'Ім’я автора',
    'filter_from_date' => 'Від (дата збереження (приблизно)):',
    'filter_to_date' => 'До (дата збереження (приблизно)):',
    'filter_apply' => 'Застосувати фільтр',

    //    Категории
    'category'          => 'Категорія:',
    'select_category'   => 'Оберіть категорію',
    'programming'       => 'Програмування',
    'ai'                => 'Штучний інтелект',
    'web_development'   => 'Веб-розробка',
    'data_science'      => 'Наука про дані',
    'cyber_security'    => 'Кібербезпека',
    'cloud_computing'   => 'Хмарні обчислення',
    'machine_learning'  => 'Машинне навчання',
    'it_news'           => 'IT новини',

    //    Поиск
    'feed' => 'Стрічка',
    'no_feed' => 'Немає публікацій від ваших підписок',
    'popular_articles' => 'Популярні статті',
    'popular_courses'  => 'Популярні курси',
    'popular_writers'  => 'Популярні IT-письменники',
    'it_events'        => 'IT-події',
    'placeholder_search' => 'Введіть ваш запит...',
    'date' => 'Дата',
    'show_more' => 'Більше',
    'search_by_tag' => 'Пошук за тегом',
    'search' => 'Пошук',
    //    Статистика
    'statistics_for' => 'Статистика для "%s"',
    'likes'          => 'Лайки',
    'view_likes'     => 'Переглянути лайки',
    'dislikes'       => 'Дизлайки',
    'view_dislikes'  => 'Переглянути дизлайки',
    'views'          => 'Перегляди',
    'author'         => 'Автор',
    'created_at'     => 'Створено',

    //    Уведомления
    'your_notifications' => 'Ваші сповіщення',

    //    Форма статей
    'content'                          => 'Зміст:',
    'write_article_content_placeholder'=> 'Напишіть вашу статтю тут...',
    'create_table'                     => 'Створити таблицю',
    'rows'                             => 'Рядки:',
    'columns'                          => 'Стовпці:',
    'insert_table'                     => 'Створити таблицю',
    'difficulty'             => 'Складність:',
    'select_difficulty'      => 'Оберіть складність',
    'beginner'               => 'Початковий',
    'intermediate'           => 'Середній',
    'advanced'               => 'Просунутий',
    'estimated_read_time'    => 'Орієнтовний час читання (в хвилинах):',
    'tags'                   => 'Теги, наприклад, IT-мови (через кому):',
    'tags_placeholder'       => 'Тег1, Тег2, Тег3',
    'tag_warning'            => 'Не більше 10 тегів!',
    'youtube_link'           => 'Посилання на YouTube:',
    'youtube_link_placeholder'=> 'https://www.youtube.com/embed/xyz',
    'cover_image'            => 'Завантажити обкладинку:',
    'cover_image_preview'    => 'Попередній перегляд обкладинки',
    'publish'                => 'Опублікувати:',
    'create_article' => 'Створити статтю',
    'add_article' => 'Додати статтю',

//    Поиск
    'view_profile'    => 'Переглянути профіль',
//    Репосты
    'view_statistics'    => 'Переглянути статистику статті',
    'delete'    => 'Видалити',
    'change_description' => 'Змінити опис',

    //    Курсы
    'create_course' => 'Створити новий курс',
    'course_title' => 'Назва курсу',
    'course_description' => 'Опис курсу',
    'create_course_button' => 'Створити курс',
    'select_articles_button' => 'Обрати статті',
    'search_articles' => 'Шукати статті',
    'articles_selected' => 'Обрані статті',
    'no_courses' => 'У вас поки що немає курсів',
    'open_course' => 'Відкрити курс',
    'edit'           => 'Редактувати',
    'courses_articles'           => 'Статті курсу',
    'no_articles'           => 'У цьому курсі поки що немає статей',
    'videos'           => 'Відео до курсів',
    'course_progress'           => 'Прогрес курсу',
    'course_passed'           => 'Пройдено',

];